if __name__ == '__main__':
    # если хочешь повыебываться то сотри строку ниже и раскоментируй следующую
    # m = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 26, 17, 18, 19, 20]
    m = list(range(1, 21))
    print("Введите начало диапазона:\n")
    a = int(input())
    print("\n")
    print("Введите конец диапазона:\n")
    b = int(input())
    print("\n")
    # массив индексов
    im = []
    for i in range(len(m)):
        if (m[i] >= a) and (m[i] <= b):
            im.append(i)

    print(im)

#hm